<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use App\Models\Department;
use App\Models\Major;
use Illuminate\Database\Seeder;

class MajorSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // 学科 => 専攻
        $majorsByDepartment = [
            'AI&テクノロジー科' => ['ホワイトハッカー専攻', 'AIエンジニア専攻', '生成AIクリエーター専攻', 'AIスタートアップ専攻', 'スポーツテック&AI専攻', 
                                   'ゲームキャラクター&グラフィック専攻', 'スーパーゲームクリエーター専攻', 'スーパーCG動画クリエーター専攻', 
                                   'イラスト&CGグラフィック専攻', 'e-sportsマネジメント専攻'],

            'デジタルテクノロジー科' => ['ITエンジニア専攻', 'e-sportsプロゲーマー専攻', 'ゲーム実況&ストリーマー専攻', 'ゲームプログラマー専攻'],
            
            'クリエイティブデザイン科' => ['コミックイラスト&マンガ専攻', '動画クリエーター専攻', 'CG・アニメーション専攻', 'メタバースクリエーター専攻', 'シナリオ&コンテンツ企画専攻'],
            
            '音楽ビジネス科' => ['DJ＆トラックメーカー専攻', 'K-POPパフォーマー専攻', 'ＰＡ＆サウンドエンジニア専攻', 'ヴォーカルアーティスト専攻',
                                'コンサート企画制作専攻', 'ダンス＆ヴォーカル専攻', 'デジタル映像クリエーター専攻', 'デジタル動画クリエーター',
                                'バックダンサー専攻', 'バンドミュージシャン専攻', 'マネージャー専攻', 'レコーディング＆MAエンジニア', 'レコーディングエンジニア専攻',
                                '作曲＆アレンジャー専攻', '照明＆ステージデザイナー専攻', '声優アーティスト専攻'],
            
            '音楽テクノロジー科' => ['K-POPアーティスト&ダンサー専攻', 'ＰＡエンジニア専攻', '映画ＴＶ番組制作専攻',
                                    '芸能タレント専攻', '照明スタッフ専攻', '舞台美術＆ステージデザイナー専攻'],
            
            'スーパーｅエンターテイメント科' => ['AI&作詞作曲本科', 'K-POP本科', 'ＮＹダンス留学本科',  'ＶＴｕｂｅｒエンターテイメント本科', 'ヴォーカル本科',
                                            'コンサートクリエーター専攻', 'コンサートプロデューサー本科', 'サウンドクリエーター本科', 'シンガーソングライター本科',
                                            'ダンスプロフェッショナル本科', 'ネットアーティスト＆クリエーター専攻', 'ネットアーティスト&クリエーター本科',
                                            'プロミュージシャン本科', '映画・動画配信＆テクノロジー本科', '芸能マネジメント&テクノロジー専攻',
                                            '動画配信＆テクノロジー専攻', '俳優＆ミュージカル本科'],
            '総合音楽科（高等課程）' => ['ｅ－ｓｐｏｒｔｓ専攻', 'Ｋ-ＰＯＰアイドル専攻', 'Ｋ-ＰＯＰダンス専攻', 'ＶＴｕｂｅｒ専攻',
                                        'アイドル・タレント専攻', 'アニメ・イラスト専攻', 'ヴォーカル専攻', 'ゲームプログラミング専攻',
                                        'シンガーソングライター専攻', 'ドラム専攻', 'プロダンサー専攻', 'ボカロＰ専攻', '作曲専攻',
                                        '声優専攻', '俳優専攻']
        ];

        foreach ($majorsByDepartment as $departmentName => $majorNames){
            $department = Department::where('name', $departmentName) -> firstOrFail();

            foreach ($majorNames as $majorName){
                Major::create([
                    'name' => $majorName,
                    'department_id' => $department->id,
                ]);
            }
        }
    }
}
